### Loading Data,Shape and Showing the first few Columns

In [19]:
import pandas as pd
import json
import pprint
import requests
import pymssql

In [28]:
data = pd.read_json('A1_cars_w_missing_data_FIXED.json')

In [29]:
data.head()

,Name,Miles_per_Gallon,Cylinders,Displacement,Horsepower,Weight_in_lbs,Acceleration,Year,Origin
0,chevrolet chevelle malibu,18,8,307,130,3504,12,1970-01-01,USA
1,buick skylark 320,15,8,350,165,3693,11.5,1970-01-01,USA
2,plymouth satellite,18,8,318,150,3436,11,1970-01-01,USA
3,amc rebel sst,16,8,304,150,3433,12,1970-01-01,USA
4,ford torino,17,8,302,140,3449,10.5,1970-01-01,USA

In [30]:
data.dtypes

Name                object
Miles_per_Gallon    object
Cylinders           object
Displacement        object
Horsepower          object
Weight_in_lbs       object
Acceleration        object
Year                object
Origin              object
dtype: object

In [31]:
data.shape

(406, 9)

### Finding and displaying the missing values for each data column

In [32]:
data.isnull().sum()

Name                0
Miles_per_Gallon    8
Cylinders           0
Displacement        0
Horsepower          6
Weight_in_lbs       0
Acceleration        0
Year                0
Origin              0
dtype: int64

### Renaming data columns

In [33]:
data.rename(columns={'Name' : 'Car_model'}, inplace=True)

In [34]:
data.head(2)

,Car_model,Miles_per_Gallon,Cylinders,Displacement,Horsepower,Weight_in_lbs,Acceleration,Year,Origin
0,chevrolet chevelle malibu,18,8,307,130,3504,12,1970-01-01,USA
1,buick skylark 320,15,8,350,165,3693,11.5,1970-01-01,USA

### Removing rows with missing data

In [43]:
data.dropna(subset=['Miles_per_Gallon','Horsepower'], inplace=True)
data.shape

(389, 9)

### Converting the data columns to numeric values

In [44]:
data[['Cylinders', 'Displacement', 'Weight_in_lbs', 'Acceleration']] = data[['Cylinders', 'Displacement',  'Weight_in_lbs', 'Acceleration']].apply(pd.to_numeric, errors='coerce')

In [45]:
data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 389 entries, 0 to 405
Data columns (total 9 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Car_model         389 non-null    object
 1   Miles_per_Gallon  389 non-null    float64
 2   Cylinders         387 non-null    float64
 3   Displacement      388 non-null    float64
 4   Horsepower        389 non-null    float64
 5   Weight_in_lbs     387 non-null    float64
 6   Acceleration      384 non-null    float64
 7   Year              389 non-null    object
 8   Origin            389 non-null    object
dtypes: float64(6), object(3)
memory usage: 30.4+ KB

### Converting all date columns to a date data type

In [47]:
pd.to_datetime(data['Year'])

0     1970-01-01
1     1970-01-01
2     1970-01-01
3     1970-01-01
4     1970-01-01
         ...
401   1982-01-01
402   1982-01-01
403   1982-01-01
404   1982-01-01
405   1982-01-01
Name: Year, Length: 389, dtype: datetime64[ns]

### Summary statistics

In [48]:
data.describe()

,Miles_per_Gallon,Cylinders,Displacement,Horsepower,Weight_in_lbs,Acceleration
count,389.000000,387.000000,388.000000,389.000000,387.000000,384.000000
mean,23.485347,5.475452,194.143041,104.437018,2969.974160,15.559115
std,7.813764,1.706826,104.806556,38.608453,849.564746,2.775324
min,9.000000,3.000000,68.000000,46.000000,1613.000000,8.000000
25%,17.000000,4.000000,104.750000,75.000000,2221.500000,13.800000
50%,23.000000,4.000000,148.500000,93.000000,2790.000000,15.500000
75%,29.000000,8.000000,263.250000,125.000000,3611.000000,17.200000
max,46.600000,8.000000,455.000000,230.000000,5140.000000,24.800000

### End Thank You!